import AvatarImageFirst from '../../../assets/characters-1.svg'
import AvatarImageSecond from '../../../assets/characters-2.svg'
import AvatarImageThird from '../../../assets/characters-3.svg'
import AvatarImageFourth from '../../../assets/characters-4.svg'
import AvatarImageFifth from '../../../assets/characters-5.svg'
import AvatarImageSixth from '../../../assets/characters-6.svg'
import AvatarImageSeventh from '../../../assets/characters-7.svg'
import AvatarImageEight from '../../../assets/characters-8.svg'
import AvatarImageNinth from '../../../assets/characters-9.svg'
import AvatarImageTenth from '../../../assets/characters-10.svg'

export const charactersList = [{
    id: 1,
    avatarImage: AvatarImageFirst,
    charactersName: 'Монки Д. Луффи',
    description: 'Монки Д. Луффи, также известный как «Соломенная Шляпа Луффи» или просто «Соломенная Шляпа» («Мугивара»), — главный герой аниме и манги One Piece. Основатель капитан Пиратов Соломенной Шляпы, а также один из четырёх лучших бойцов.\n' +
        'Его мечта — стать Королём Пиратов, и найти легендарное сокровище Ван Пис, оставленное покойным Королём Пиратов — Гол Д. Роджером. Он верит, что став Королём Пиратов, он станет самым свободным человеком в мире. Он съел Дьявольский плод Гому Гому но Ми, обретя возможность растягивать своё тело подобно резине.',
},
    {
        id: 2,
        avatarImage: AvatarImageSecond,
        charactersName: 'Ророноа Зоро',
        description: 'Ророноа Зоро — пират, бывший охотник за головами и один из главных протагонистов One Piece.Ророноа Зоро был первым, кто присоединился к Пиратам Соломенной Шляпы и является одним из четырёх сильнейших членов команды, а его мечта — стать величайшим мечником в мире. Из за его огромной силы и сдержанности, разительно отличающейся от легкомысленного поведения Луффи, многие зачастую принимали его за капитана команды или за первого помощника.',
    },
    {
        id: 3,
        avatarImage: AvatarImageThird,
        charactersName: 'Винсмок Санджи',
        description: 'Винсмок Санджи, также известный как «Чёрная нога» Санджи — пират и кок в команде Пиратов Соломенной Шляпы, бывший шеф-повар ресторана Барати. Он также является третьим сыном семьи Винсмок, что делало его принцем королевства Джерма, до тех пор, пока он не отрёкся от этого титула во второй раз. Он является пятым членом команды и четвёртым присоединившимся. Так как Санджи родился в Норт Блю, он является первым Пиратом Соломенной Шляпы родом не из Ист Блю. Санджи считается одним из так называемого «Трио Монстров» команды, наряду с Луффи и Зоро.',
    },
    {
        id: 4,
        avatarImage: AvatarImageFourth,
        charactersName: 'Нами',
        description: 'Нами — пират и навигатор в команде пиратов Соломенной Шляпы. Она официально стала третьим членом экипажа и вторым присоединившимся к команде после победы Луффи над Арлонгом. Во время арки Барати она временно покидает команду, но возвращается в конце арки Арлонг Парка, после того как было раскрыто её прошлое и истинные намерения. Её текущая награда 366 000 000 Beli.',
    },
    {
        id: 5,
        avatarImage: AvatarImageFifth,
        charactersName: 'Усопп',
        description: 'Усопп — пират и снайпер в команде пиратов Соломенной Шляпы, а также бывший капитан пиратов Усоппа. Когда он впервые появился, его часто в шутку называли «Лжецом» пиратов Соломенной Шляпы, так как «Усо» в его имени переводится как «ложь». Он родился в деревне Сиропа и впервые упоминается его отцом, Ясоппом. Несмотря на свою обычную трусость, Усопп мечтает стать храбрым воином моря, как и его отец, и живёт каждый день, преследуя эту мечту.',
    },
    {
        id: 6,
        avatarImage: AvatarImageSixth,
        charactersName: 'Нико Робин',
        description: 'Нико Робин — пират и археолог в команде Соломенной Шляпы. Впервые появилась как вице-президент Барок Воркс под псевдонимом Мисс Олл Сандей. Она седьмой член команды, шестой, кто присоединился к Луффи, и второй, после Нами, вернувшийся в команду после ухода из неё (она сделала это ближе к концу арки Эниес Лобби), а также первый член, когда-то бывший антагонистом. Она съела Дьявольский плод Хана Хана. Её мечта — найти Рио Понеглиф, в котором содержится истинная история. Текущая награда — 930 000 000 Beli.',
    },
    {
        id: 7,
        avatarImage: AvatarImageSeventh,
        charactersName: 'Тони Тони Чоппер',
        description: 'Тони Тони Чоппер (так же известный, как "Любитель Сладкой Ваты") — пират и врач в команде пиратов Соломенной Шляпы. Чоппер - северный олень, который съел Дьявольский плод Хито Хито но Ми. получив возможность становиться человеком. Он родился на Острове Драм, на котором он получил свои выдающиеся знания в области медицины. Остров Драм находится на Гранд Лайн, что делает Чоппера первым членом команды Мугивар, который родился на Гранд Лайн. Он является шестым членом команды и пятым присоединившимся к Луффи, а также самым младшим членом на борту корабля.',
    },
    {
        id: 8,
        avatarImage: AvatarImageEight,
        charactersName: 'Брук',
        description: '«Соул Кинг» Брук - пират и музыкант, член команды пиратов Соломенной Шляпы. Он живой скелет, с которым Соломенные Шляпы встретились на борту корабля-призрака, дрейфующего во Флорианском Треугольнике. Брук съел Дьявольский плод Ёми Ёми, благодаря которому воскрес после своей смерти. Его мечта — вернуться к своему накама, Лабуну. Он является девятым членом команды Соломенной Шляпы и восьмым, кто присоединился к Луффи, став при этом старейшим пиратом в команде. Также, он второй мечник на борту корабля (первым стал Зоро) и долгожданный музыкант, которого Луффи хотел в команду ещё в самом начале своего путешествия.',
    },
    {
        id: 9,
        avatarImage: AvatarImageNinth,
        charactersName: 'Дзимбей',
        description: '«Рыцарь Моря» Дзимбэй — член Пиратов Соломенной Шляпы, где также является рулевым . На данный момент он официально является десятым членом Пиратов Соломенной Шляпы и девятым, присоединившимся к команде Луффи.\n' +
            'Он также является рыбочеловеком-китовая акула, вторым, после Фишера Тайгера капитаном Пиратов Солнца, а также бывшим Ситибукаем, пост которого получил восемь лет назад.',
    },
    {
        id: 10,
        avatarImage: AvatarImageTenth,
        charactersName: 'Фрэнки',
        description: 'Фрэнки — пират и корабельный плотник в команде пиратов Соломенной Шляпы. Он является 36-летним киборгом из Water 7 и впервые появляется в сюжете как лидер Клана Фрэнки. Настоящее имя — Катти Флам, но он отказался от него по просьбе Айсберга, чтобы скрыть свою личность, и стал жить под псевдонимом. Первоначально Фрэнки и его последователи были представлены в арке Water 7 как антагонисты Мугивар, но обстоятельства заставили их стать союзниками. По просьбе Клана Фрэнки, он вступил в команду Соломенных Шляп, чтобы осуществить свою мечту о создании корабля мечты и достижения на нём конца Гранд Лайна.',
    },
]